AlmAck/svdtonuttx/demo/h/da1470x_gpio.h
/****************************************************************************
 * ./tmp/da1470x_gpio.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470X_GPIO_H
#define __DA1470X_GPIO_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470x_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470X_GPIO_GPIO_CLK_SEL_OFFSET      0x016C /* Select which clock to map on ports P0/P1 */
#define DA1470X_GPIO_LCDC_MAP_CTRL_OFFSET     0x017C /* LCDC mapping control Register */
#define DA1470X_GPIO_P0_00_MODE_OFFSET        0x0024 /* P0_00 Mode Register */
#define DA1470X_GPIO_P0_01_MODE_OFFSET        0x0028 /* P0_01 Mode Register */
#define DA1470X_GPIO_P0_02_MODE_OFFSET        0x002C /* P0_02 Mode Register */
#define DA1470X_GPIO_P0_03_MODE_OFFSET        0x0030 /* P0_03 Mode Register */
#define DA1470X_GPIO_P0_04_MODE_OFFSET        0x0034 /* P0_04 Mode Register */
#define DA1470X_GPIO_P0_05_MODE_OFFSET        0x0038 /* P0_05 Mode Register */
#define DA1470X_GPIO_P0_06_MODE_OFFSET        0x003C /* P0_06 Mode Register */
#define DA1470X_GPIO_P0_07_MODE_OFFSET        0x0040 /* P0_07 Mode Register */
#define DA1470X_GPIO_P0_08_MODE_OFFSET        0x0044 /* P0_08 Mode Register */
#define DA1470X_GPIO_P0_09_MODE_OFFSET        0x0048 /* P0_09 Mode Register */
#define DA1470X_GPIO_P0_10_MODE_OFFSET        0x004C /* P0_10 Mode Register */
#define DA1470X_GPIO_P0_11_MODE_OFFSET        0x0050 /* P0_11 Mode Register */
#define DA1470X_GPIO_P0_12_MODE_OFFSET        0x0054 /* P0_12 Mode Register */
#define DA1470X_GPIO_P0_13_MODE_OFFSET        0x0058 /* P0_13 Mode Register */
#define DA1470X_GPIO_P0_14_MODE_OFFSET        0x005C /* P0_14 Mode Register */
#define DA1470X_GPIO_P0_15_MODE_OFFSET        0x0060 /* P0_15 Mode Register */
#define DA1470X_GPIO_P0_16_MODE_OFFSET        0x0064 /* P0_16 Mode Register */
#define DA1470X_GPIO_P0_17_MODE_OFFSET        0x0068 /* P0_17 Mode Register */
#define DA1470X_GPIO_P0_18_MODE_OFFSET        0x006C /* P0_18 Mode Register */
#define DA1470X_GPIO_P0_19_MODE_OFFSET        0x0070 /* P0_19 Mode Register */
#define DA1470X_GPIO_P0_20_MODE_OFFSET        0x0074 /* P0_20 Mode Register */
#define DA1470X_GPIO_P0_21_MODE_OFFSET        0x0078 /* P0_21 Mode Register */
#define DA1470X_GPIO_P0_22_MODE_OFFSET        0x007C /* P0_22 Mode Register */
#define DA1470X_GPIO_P0_23_MODE_OFFSET        0x0080 /* P0_23 Mode Register */
#define DA1470X_GPIO_P0_24_MODE_OFFSET        0x0084 /* P0_24 Mode Register */
#define DA1470X_GPIO_P0_25_MODE_OFFSET        0x0088 /* P0_25 Mode Register */
#define DA1470X_GPIO_P0_26_MODE_OFFSET        0x008C /* P0_26 Mode Register */
#define DA1470X_GPIO_P0_27_MODE_OFFSET        0x0090 /* P0_27 Mode Register */
#define DA1470X_GPIO_P0_28_MODE_OFFSET        0x0094 /* P0_28 Mode Register */
#define DA1470X_GPIO_P0_29_MODE_OFFSET        0x0098 /* P0_29 Mode Register */
#define DA1470X_GPIO_P0_30_MODE_OFFSET        0x009C /* P0_30 Mode Register */
#define DA1470X_GPIO_P0_31_MODE_OFFSET        0x00A0 /* P0_31 Mode Register */
#define DA1470X_GPIO_P0_DATA_OFFSET           0x0000 /* P0 Data input / output Register */
#define DA1470X_GPIO_P0_PADPWR_CTRL_OFFSET    0x0160 /* P0 Output Power Control Register */
#define DA1470X_GPIO_P0_RESET_DATA_OFFSET     0x0018 /* P0 Reset port pins Register */
#define DA1470X_GPIO_P0_SET_DATA_OFFSET       0x000C /* P0 Set port pins Register */
#define DA1470X_GPIO_P0_WEAK_CTRL_OFFSET      0x0170 /* P0 Weak Pads Control Register */
#define DA1470X_GPIO_P1_00_MODE_OFFSET        0x00A4 /* P1_00 Mode Register */
#define DA1470X_GPIO_P1_01_MODE_OFFSET        0x00A8 /* P1_01 Mode Register */
#define DA1470X_GPIO_P1_02_MODE_OFFSET        0x00AC /* P1_02 Mode Register */
#define DA1470X_GPIO_P1_03_MODE_OFFSET        0x00B0 /* P1_03 Mode Register */
#define DA1470X_GPIO_P1_04_MODE_OFFSET        0x00B4 /* P1_04 Mode Register */
#define DA1470X_GPIO_P1_05_MODE_OFFSET        0x00B8 /* P1_05 Mode Register */
#define DA1470X_GPIO_P1_06_MODE_OFFSET        0x00BC /* P1_06 Mode Register */
#define DA1470X_GPIO_P1_07_MODE_OFFSET        0x00C0 /* P1_07 Mode Register */
#define DA1470X_GPIO_P1_08_MODE_OFFSET        0x00C4 /* P1_08 Mode Register */
#define DA1470X_GPIO_P1_09_MODE_OFFSET        0x00C8 /* P1_09 Mode Register */
#define DA1470X_GPIO_P1_10_MODE_OFFSET        0x00CC /* P1_10 Mode Register */
#define DA1470X_GPIO_P1_11_MODE_OFFSET        0x00D0 /* P1_11 Mode Register */
#define DA1470X_GPIO_P1_12_MODE_OFFSET        0x00D4 /* P1_12 Mode Register */
#define DA1470X_GPIO_P1_13_MODE_OFFSET        0x00D8 /* P1_13 Mode Register */
#define DA1470X_GPIO_P1_14_MODE_OFFSET        0x00DC /* P1_14 Mode Register */
#define DA1470X_GPIO_P1_15_MODE_OFFSET        0x00E0 /* P1_15 Mode Register */
#define DA1470X_GPIO_P1_16_MODE_OFFSET        0x00E4 /* P1_16 Mode Register */
#define DA1470X_GPIO_P1_17_MODE_OFFSET        0x00E8 /* P1_17 Mode Register */
#define DA1470X_GPIO_P1_18_MODE_OFFSET        0x00EC /* P1_18 Mode Register */
#define DA1470X_GPIO_P1_19_MODE_OFFSET        0x00F0 /* P1_19 Mode Register */
#define DA1470X_GPIO_P1_20_MODE_OFFSET        0x00F4 /* P1_20 Mode Register */
#define DA1470X_GPIO_P1_21_MODE_OFFSET        0x00F8 /* P1_21 Mode Register */
#define DA1470X_GPIO_P1_22_MODE_OFFSET        0x00FC /* P1_22 Mode Register */
#define DA1470X_GPIO_P1_23_MODE_OFFSET        0x0100 /* P1_23 Mode Register */
#define DA1470X_GPIO_P1_24_MODE_OFFSET        0x0104 /* P1_24 Mode Register */
#define DA1470X_GPIO_P1_25_MODE_OFFSET        0x0108 /* P1_25 Mode Register */
#define DA1470X_GPIO_P1_26_MODE_OFFSET        0x010C /* P1_26 Mode Register */
#define DA1470X_GPIO_P1_27_MODE_OFFSET        0x0110 /* P1_27 Mode Register */
#define DA1470X_GPIO_P1_28_MODE_OFFSET        0x0114 /* P1_28 Mode Register */
#define DA1470X_GPIO_P1_29_MODE_OFFSET        0x0118 /* P1_29 Mode Register */
#define DA1470X_GPIO_P1_30_MODE_OFFSET        0x011C /* P1_30 Mode Register */
#define DA1470X_GPIO_P1_31_MODE_OFFSET        0x0120 /* P1_31 Mode Register */
#define DA1470X_GPIO_P1_DATA_OFFSET           0x0004 /* P1 Data input / output Register */
#define DA1470X_GPIO_P1_PADPWR_CTRL_OFFSET    0x0164 /* P1 Output Power Control Register */
#define DA1470X_GPIO_P1_RESET_DATA_OFFSET     0x001C /* P1 Reset port pins Register */
#define DA1470X_GPIO_P1_SET_DATA_OFFSET       0x0010 /* P1 Set port pins Register */
#define DA1470X_GPIO_P1_WEAK_CTRL_OFFSET      0x0174 /* P1 Weak Pads Control Register */
#define DA1470X_GPIO_P2_00_MODE_OFFSET        0x0124 /* P2_00 Mode Register */
#define DA1470X_GPIO_P2_01_MODE_OFFSET        0x0128 /* P2_01 Mode Register */
#define DA1470X_GPIO_P2_02_MODE_OFFSET        0x012C /* P2_02 Mode Register */
#define DA1470X_GPIO_P2_03_MODE_OFFSET        0x0130 /* P2_03 Mode Register */
#define DA1470X_GPIO_P2_04_MODE_OFFSET        0x0134 /* P2_04 Mode Register */
#define DA1470X_GPIO_P2_05_MODE_OFFSET        0x0138 /* P2_05 Mode Register */
#define DA1470X_GPIO_P2_06_MODE_OFFSET        0x013C /* P2_06 Mode Register */
#define DA1470X_GPIO_P2_07_MODE_OFFSET        0x0140 /* P2_07 Mode Register */
#define DA1470X_GPIO_P2_08_MODE_OFFSET        0x0144 /* P2_08 Mode Register */
#define DA1470X_GPIO_P2_09_MODE_OFFSET        0x0148 /* P2_09 Mode Register */
#define DA1470X_GPIO_P2_10_MODE_OFFSET        0x014C /* P2_10 Mode Register */
#define DA1470X_GPIO_P2_11_MODE_OFFSET        0x0150 /* P2_11 Mode Register */
#define DA1470X_GPIO_P2_12_MODE_OFFSET        0x0154 /* P2_12 Mode Register */
#define DA1470X_GPIO_P2_13_MODE_OFFSET        0x0158 /* P2_13 Mode Register */
#define DA1470X_GPIO_P2_14_MODE_OFFSET        0x015C /* P2_14 Mode Register */
#define DA1470X_GPIO_P2_DATA_OFFSET           0x0008 /* P2 Data input / output Register */
#define DA1470X_GPIO_P2_PADPWR_CTRL_OFFSET    0x0168 /* P2 Output Power Control Register */
#define DA1470X_GPIO_P2_RESET_DATA_OFFSET     0x0020 /* P0 Reset port pins Register */
#define DA1470X_GPIO_P2_SET_DATA_OFFSET       0x0014 /* P1 Set port pins Register */
#define DA1470X_GPIO_P2_WEAK_CTRL_OFFSET      0x0178 /* P2 Weak Pads Control Register */
#define DA1470X_GPIO_PAD_DRIVE_CTRL_OFFSET    0x0180 /* Pad drive control for SPI3/eMMC */

