AlmAck/svdtonuttx/demo/h/da1470x_gpio.h
/* Register addresses *******************************************************/

#define DA1470X_GPIO_BASE                     0x50050100 /* GPIO registers */

#define DA1470X_GPIO_GPIO_CLK_SEL             (DA1470X_GPIO_BASE + DA1470X_GPIO_GPIO_CLK_SEL_OFFSET) /* Select which clock to map on ports P0/P1 */
#define DA1470X_GPIO_LCDC_MAP_CTRL            (DA1470X_GPIO_BASE + DA1470X_GPIO_LCDC_MAP_CTRL_OFFSET) /* LCDC mapping control Register */
#define DA1470X_GPIO_P0_00_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_00_MODE_OFFSET) /* P0_00 Mode Register */
#define DA1470X_GPIO_P0_01_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_01_MODE_OFFSET) /* P0_01 Mode Register */
#define DA1470X_GPIO_P0_02_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_02_MODE_OFFSET) /* P0_02 Mode Register */
#define DA1470X_GPIO_P0_03_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_03_MODE_OFFSET) /* P0_03 Mode Register */
#define DA1470X_GPIO_P0_04_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_04_MODE_OFFSET) /* P0_04 Mode Register */
#define DA1470X_GPIO_P0_05_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_05_MODE_OFFSET) /* P0_05 Mode Register */
#define DA1470X_GPIO_P0_06_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_06_MODE_OFFSET) /* P0_06 Mode Register */
#define DA1470X_GPIO_P0_07_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_07_MODE_OFFSET) /* P0_07 Mode Register */
#define DA1470X_GPIO_P0_08_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_08_MODE_OFFSET) /* P0_08 Mode Register */
#define DA1470X_GPIO_P0_09_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_09_MODE_OFFSET) /* P0_09 Mode Register */
#define DA1470X_GPIO_P0_10_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_10_MODE_OFFSET) /* P0_10 Mode Register */
#define DA1470X_GPIO_P0_11_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_11_MODE_OFFSET) /* P0_11 Mode Register */
#define DA1470X_GPIO_P0_12_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_12_MODE_OFFSET) /* P0_12 Mode Register */
#define DA1470X_GPIO_P0_13_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_13_MODE_OFFSET) /* P0_13 Mode Register */
#define DA1470X_GPIO_P0_14_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_14_MODE_OFFSET) /* P0_14 Mode Register */
#define DA1470X_GPIO_P0_15_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_15_MODE_OFFSET) /* P0_15 Mode Register */
#define DA1470X_GPIO_P0_16_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_16_MODE_OFFSET) /* P0_16 Mode Register */
#define DA1470X_GPIO_P0_17_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_17_MODE_OFFSET) /* P0_17 Mode Register */
#define DA1470X_GPIO_P0_18_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_18_MODE_OFFSET) /* P0_18 Mode Register */
#define DA1470X_GPIO_P0_19_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_19_MODE_OFFSET) /* P0_19 Mode Register */
#define DA1470X_GPIO_P0_20_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_20_MODE_OFFSET) /* P0_20 Mode Register */
#define DA1470X_GPIO_P0_21_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_21_MODE_OFFSET) /* P0_21 Mode Register */
#define DA1470X_GPIO_P0_22_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_22_MODE_OFFSET) /* P0_22 Mode Register */
#define DA1470X_GPIO_P0_23_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_23_MODE_OFFSET) /* P0_23 Mode Register */
#define DA1470X_GPIO_P0_24_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_24_MODE_OFFSET) /* P0_24 Mode Register */
#define DA1470X_GPIO_P0_25_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_25_MODE_OFFSET) /* P0_25 Mode Register */
#define DA1470X_GPIO_P0_26_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_26_MODE_OFFSET) /* P0_26 Mode Register */
#define DA1470X_GPIO_P0_27_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_27_MODE_OFFSET) /* P0_27 Mode Register */
#define DA1470X_GPIO_P0_28_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_28_MODE_OFFSET) /* P0_28 Mode Register */
#define DA1470X_GPIO_P0_29_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_29_MODE_OFFSET) /* P0_29 Mode Register */
#define DA1470X_GPIO_P0_30_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_30_MODE_OFFSET) /* P0_30 Mode Register */
#define DA1470X_GPIO_P0_31_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_31_MODE_OFFSET) /* P0_31 Mode Register */
#define DA1470X_GPIO_P0_DATA                  (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_DATA_OFFSET) /* P0 Data input / output Register */
#define DA1470X_GPIO_P0_PADPWR_CTRL           (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_PADPWR_CTRL_OFFSET) /* P0 Output Power Control Register */
#define DA1470X_GPIO_P0_RESET_DATA            (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_RESET_DATA_OFFSET) /* P0 Reset port pins Register */
#define DA1470X_GPIO_P0_SET_DATA              (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_SET_DATA_OFFSET) /* P0 Set port pins Register */
#define DA1470X_GPIO_P0_WEAK_CTRL             (DA1470X_GPIO_BASE + DA1470X_GPIO_P0_WEAK_CTRL_OFFSET) /* P0 Weak Pads Control Register */
#define DA1470X_GPIO_P1_00_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_00_MODE_OFFSET) /* P1_00 Mode Register */
#define DA1470X_GPIO_P1_01_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_01_MODE_OFFSET) /* P1_01 Mode Register */
#define DA1470X_GPIO_P1_02_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_02_MODE_OFFSET) /* P1_02 Mode Register */
#define DA1470X_GPIO_P1_03_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_03_MODE_OFFSET) /* P1_03 Mode Register */
#define DA1470X_GPIO_P1_04_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_04_MODE_OFFSET) /* P1_04 Mode Register */
#define DA1470X_GPIO_P1_05_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_05_MODE_OFFSET) /* P1_05 Mode Register */
#define DA1470X_GPIO_P1_06_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_06_MODE_OFFSET) /* P1_06 Mode Register */
#define DA1470X_GPIO_P1_07_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_07_MODE_OFFSET) /* P1_07 Mode Register */
#define DA1470X_GPIO_P1_08_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_08_MODE_OFFSET) /* P1_08 Mode Register */
#define DA1470X_GPIO_P1_09_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_09_MODE_OFFSET) /* P1_09 Mode Register */
#define DA1470X_GPIO_P1_10_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_10_MODE_OFFSET) /* P1_10 Mode Register */
#define DA1470X_GPIO_P1_11_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_11_MODE_OFFSET) /* P1_11 Mode Register */
#define DA1470X_GPIO_P1_12_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_12_MODE_OFFSET) /* P1_12 Mode Register */
#define DA1470X_GPIO_P1_13_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_13_MODE_OFFSET) /* P1_13 Mode Register */
#define DA1470X_GPIO_P1_14_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_14_MODE_OFFSET) /* P1_14 Mode Register */
#define DA1470X_GPIO_P1_15_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_15_MODE_OFFSET) /* P1_15 Mode Register */
#define DA1470X_GPIO_P1_16_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_16_MODE_OFFSET) /* P1_16 Mode Register */
#define DA1470X_GPIO_P1_17_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_17_MODE_OFFSET) /* P1_17 Mode Register */
#define DA1470X_GPIO_P1_18_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_18_MODE_OFFSET) /* P1_18 Mode Register */
#define DA1470X_GPIO_P1_19_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_19_MODE_OFFSET) /* P1_19 Mode Register */
#define DA1470X_GPIO_P1_20_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_20_MODE_OFFSET) /* P1_20 Mode Register */
#define DA1470X_GPIO_P1_21_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_21_MODE_OFFSET) /* P1_21 Mode Register */
#define DA1470X_GPIO_P1_22_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_22_MODE_OFFSET) /* P1_22 Mode Register */
#define DA1470X_GPIO_P1_23_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_23_MODE_OFFSET) /* P1_23 Mode Register */
#define DA1470X_GPIO_P1_24_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_24_MODE_OFFSET) /* P1_24 Mode Register */
#define DA1470X_GPIO_P1_25_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_25_MODE_OFFSET) /* P1_25 Mode Register */
#define DA1470X_GPIO_P1_26_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_26_MODE_OFFSET) /* P1_26 Mode Register */
#define DA1470X_GPIO_P1_27_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_27_MODE_OFFSET) /* P1_27 Mode Register */
#define DA1470X_GPIO_P1_28_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_28_MODE_OFFSET) /* P1_28 Mode Register */
#define DA1470X_GPIO_P1_29_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_29_MODE_OFFSET) /* P1_29 Mode Register */
#define DA1470X_GPIO_P1_30_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_30_MODE_OFFSET) /* P1_30 Mode Register */
#define DA1470X_GPIO_P1_31_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_31_MODE_OFFSET) /* P1_31 Mode Register */
#define DA1470X_GPIO_P1_DATA                  (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_DATA_OFFSET) /* P1 Data input / output Register */
#define DA1470X_GPIO_P1_PADPWR_CTRL           (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_PADPWR_CTRL_OFFSET) /* P1 Output Power Control Register */
#define DA1470X_GPIO_P1_RESET_DATA            (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_RESET_DATA_OFFSET) /* P1 Reset port pins Register */
#define DA1470X_GPIO_P1_SET_DATA              (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_SET_DATA_OFFSET) /* P1 Set port pins Register */
#define DA1470X_GPIO_P1_WEAK_CTRL             (DA1470X_GPIO_BASE + DA1470X_GPIO_P1_WEAK_CTRL_OFFSET) /* P1 Weak Pads Control Register */
#define DA1470X_GPIO_P2_00_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_00_MODE_OFFSET) /* P2_00 Mode Register */
#define DA1470X_GPIO_P2_01_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_01_MODE_OFFSET) /* P2_01 Mode Register */
#define DA1470X_GPIO_P2_02_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_02_MODE_OFFSET) /* P2_02 Mode Register */
#define DA1470X_GPIO_P2_03_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_03_MODE_OFFSET) /* P2_03 Mode Register */
#define DA1470X_GPIO_P2_04_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_04_MODE_OFFSET) /* P2_04 Mode Register */
#define DA1470X_GPIO_P2_05_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_05_MODE_OFFSET) /* P2_05 Mode Register */
#define DA1470X_GPIO_P2_06_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_06_MODE_OFFSET) /* P2_06 Mode Register */
#define DA1470X_GPIO_P2_07_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_07_MODE_OFFSET) /* P2_07 Mode Register */
#define DA1470X_GPIO_P2_08_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_08_MODE_OFFSET) /* P2_08 Mode Register */
#define DA1470X_GPIO_P2_09_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_09_MODE_OFFSET) /* P2_09 Mode Register */
#define DA1470X_GPIO_P2_10_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_10_MODE_OFFSET) /* P2_10 Mode Register */
#define DA1470X_GPIO_P2_11_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_11_MODE_OFFSET) /* P2_11 Mode Register */
#define DA1470X_GPIO_P2_12_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_12_MODE_OFFSET) /* P2_12 Mode Register */
#define DA1470X_GPIO_P2_13_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_13_MODE_OFFSET) /* P2_13 Mode Register */
#define DA1470X_GPIO_P2_14_MODE               (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_14_MODE_OFFSET) /* P2_14 Mode Register */
#define DA1470X_GPIO_P2_DATA                  (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_DATA_OFFSET) /* P2 Data input / output Register */
#define DA1470X_GPIO_P2_PADPWR_CTRL           (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_PADPWR_CTRL_OFFSET) /* P2 Output Power Control Register */
#define DA1470X_GPIO_P2_RESET_DATA            (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_RESET_DATA_OFFSET) /* P0 Reset port pins Register */
#define DA1470X_GPIO_P2_SET_DATA              (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_SET_DATA_OFFSET) /* P1 Set port pins Register */
#define DA1470X_GPIO_P2_WEAK_CTRL             (DA1470X_GPIO_BASE + DA1470X_GPIO_P2_WEAK_CTRL_OFFSET) /* P2 Weak Pads Control Register */
#define DA1470X_GPIO_PAD_DRIVE_CTRL           (DA1470X_GPIO_BASE + DA1470X_GPIO_PAD_DRIVE_CTRL_OFFSET) /* Pad drive control for SPI3/eMMC */

/* Register bit definitions *************************************************/


/* GPIO_CLK_SEL Register */

