AlmAck/svdtonuttx/demo/h/da1470x_gpio.h
#define GPIO_DIVN_OUTPUT_EN                   (1U << 9) /* DIVN output enable bit-field. When set, it enables the mapping of DIVN clock on  */
#define GPIO_XTAL32M_OUTPUT_EN                (1U << 7) /* XTAL32M output enable bit-field. When set, it enables the mapping of XTAL32M clo */
#define GPIO_RCX_OUTPUT_EN                    (1U << 6) /* RCX output enable bit-field. When set, it enables the mapping of RCX clock on de */
#define GPIO_RCLP_OUTPUT_EN                   (1U << 5) /* RCLP output enable bit-field. When set, it enables the mapping of RCLP clock on  */
#define GPIO_XTAL32K_OUTPUT_EN                (1U << 4) /* XTAL32K output enable bit-field. When set, it enables the mapping of XTAL32K clo */
#define GPIO_FUNC_CLOCK_EN                    (1U << 3) /* If set, it enables the mapping of the selected clock signal, according to FUNC_C */
#define GPIO_FUNC_CLOCK_SEL_MASK              (0x7 << 0) /* Select which clock to map when PID = FUNC_CLOCK. 0x0: XTAL32K 0x1: RCLP 0x2: RCX */
#define GPIO_FUNC_CLOCK_SEL_POS               (0) /* Select which clock to map when PID = FUNC_CLOCK. 0x0: XTAL32K 0x1: RCLP 0x2: RCX */

/* LCDC_MAP_CTRL Register */

#define GPIO_MAP_ON_P1_07_EN                  (1U << 14) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P1_07, overrulin */
#define GPIO_MAP_ON_P1_01_EN                  (1U << 13) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P1_01, overrulin */
#define GPIO_MAP_ON_P1_00_EN                  (1U << 12) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P1_00, overrulin */
#define GPIO_MAP_ON_P0_24_EN                  (1U << 11) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P0_24, overrulin */
#define GPIO_MAP_ON_P0_23_EN                  (1U << 10) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P0_23, overrulin */
#define GPIO_MAP_ON_P0_22_EN                  (1U << 9) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P0_22, overrulin */
#define GPIO_MAP_ON_P0_21_EN                  (1U << 8) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P0_21, overrulin */
#define GPIO_MAP_ON_P0_19_EN                  (1U << 7) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P0_19, overrulin */
#define GPIO_MAP_ON_P0_18_EN                  (1U << 6) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P0_18, overrulin */
#define GPIO_MAP_ON_P0_17_EN                  (1U << 5) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P0_17, overrulin */
#define GPIO_MAP_ON_P0_16_EN                  (1U << 4) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P0_16, overrulin */
#define GPIO_MAP_ON_P0_15_EN                  (1U << 3) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P0_15, overrulin */
#define GPIO_MAP_ON_P0_14_EN                  (1U << 2) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P0_14, overrulin */
#define GPIO_MAP_ON_P0_10_EN                  (1U << 1) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P0_10, overrulin */
#define GPIO_MAP_ON_P0_09_EN                  (1U << 0) /* 0 = Normal operation 1 = Enables the mapping of LCDC signals on P0_09, overrulin */

/* P0_00_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* Function of port: 0: GPIO 1: UART_RX 2: UART_TX 3: UART2_RX 4: UART2_TX 5: UART2 */
#define GPIO_PID_POS                          (0) /* Function of port: 0: GPIO 1: UART_RX 2: UART_TX 3: UART2_RX 4: UART2_TX 5: UART2 */

/* P0_01_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_02_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_03_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_04_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_05_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_06_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_07_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_08_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_09_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_10_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_11_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_12_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

