AlmAck/svdtonuttx/demo/h/da1470x_gpio.h
/* P0_13_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_14_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_15_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_16_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_17_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_18_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_19_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_20_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_21_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_22_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_23_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_24_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

