AlmAck/svdtonuttx/demo/h/da1470x_gpio.h
/* P0_25_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_26_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_27_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_28_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_29_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_30_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_31_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P0_DATA Register */

#define GPIO_P0_DATA_MASK                     (0xFFFFFFFF << 0) /* Set P0 output register when written; Returns the value of P0 port when read */
#define GPIO_P0_DATA_POS                      (0) /* Set P0 output register when written; Returns the value of P0 port when read */

/* P0_PADPWR_CTRL Register */

#define GPIO_P0_31_OUT_CTRL                   (1U << 31) /* 0 = P0_31 port output is powered by the V30 rail (default) 1 = P0_31 port output */
#define GPIO_P0_30_OUT_CTRL                   (1U << 30) /* 0 = P0_30 port output is powered by the V30 rail (default) 1 = P0_30 port output */
#define GPIO_P0_29_OUT_CTRL                   (1U << 29) /* 0 = P0_29 port output is powered by the V30 rail (default) 1 = P0_29 port output */
#define GPIO_P0_28_OUT_CTRL                   (1U << 28) /* 0 = P0_28 port output is powered by the V30 rail (default) 1 = P0_28 port output */
#define GPIO_P0_27_OUT_CTRL                   (1U << 27) /* 0 = P0_27 port output is powered by the V30 rail (default) 1 = P0_27 port output */
#define GPIO_P0_24_OUT_CTRL                   (1U << 24) /* 0 = P0_24 port output is powered by the V30 rail (default) 1 = P0_24 port output */
#define GPIO_P0_23_OUT_CTRL                   (1U << 23) /* 0 = P0_23 port output is powered by the V30 rail (default) 1 = P0_23 port output */
#define GPIO_P0_22_OUT_CTRL                   (1U << 22) /* 0 = P0_22 port output is powered by the V30 rail (default) 1 = P0_22 port output */
#define GPIO_P0_21_OUT_CTRL                   (1U << 21) /* 0 = P0_21 port output is powered by the V30 rail (default) 1 = P0_21 port output */
#define GPIO_P0_20_OUT_CTRL                   (1U << 20) /* 0 = P0_20 port output is powered by the V30 rail (default) 1 = P0_20 port output */
#define GPIO_P0_19_OUT_CTRL                   (1U << 19) /* 0 = P0_19 port output is powered by the V30 rail (default) 1 = P0_19 port output */
#define GPIO_P0_18_OUT_CTRL                   (1U << 18) /* 0 = P0_18 port output is powered by the V30 rail (default) 1 = P0_18 port output */
#define GPIO_P0_17_OUT_CTRL                   (1U << 17) /* 0 = P0_17 port output is powered by the V30 rail (default) 1 = P0_17 port output */
#define GPIO_P0_16_OUT_CTRL                   (1U << 16) /* 0 = P0_16 port output is powered by the V30 rail (default) 1 = P0_16 port output */
#define GPIO_P0_15_OUT_CTRL                   (1U << 15) /* 0 = P0_15 port output is powered by the V30 rail (default) 1 = P0_15 port output */
#define GPIO_P0_14_OUT_CTRL                   (1U << 14) /* 0 = P0_14 port output is powered by the V30 rail (default) 1 = P0_14 port output */
#define GPIO_P0_11_OUT_CTRL                   (1U << 11) /* 0 = P0_11 port output is powered by the V30 rail (default) 1 = P0_11 port output */
#define GPIO_P0_10_OUT_CTRL                   (1U << 10) /* 0 = P0_10 port output is powered by the V30 rail (default) 1 = P0_10 port output */
#define GPIO_P0_09_OUT_CTRL                   (1U << 9) /* 0 = P0_09 port output is powered by the V30 rail (default) 1 = P0_09 port output */
#define GPIO_P0_08_OUT_CTRL                   (1U << 8) /* 0 = P0_08 port output is powered by the V30 rail (default) 1 = P0_08 port output */
#define GPIO_P0_07_OUT_CTRL                   (1U << 7) /* 0 = P0_07 port output is powered by the V30 rail (default) 1 = P0_07 port output */
#define GPIO_P0_06_OUT_CTRL                   (1U << 6) /* 0 = P0_06 port output is powered by the V30 rail (default) 1 = P0_06 port output */
#define GPIO_P0_05_OUT_CTRL                   (1U << 5) /* 0 = P0_05 port output is powered by the V30 rail (default) 1 = P0_05 port output */
#define GPIO_P0_04_OUT_CTRL                   (1U << 4) /* 0 = P0_04 port output is powered by the V30 rail (default) 1 = P0_04 port output */
#define GPIO_P0_03_OUT_CTRL                   (1U << 3) /* 0 = P0_03 port output is powered by the V30 rail (default) 1 = P0_03 port output */
#define GPIO_P0_02_OUT_CTRL                   (1U << 2) /* 0 = P0_02 port output is powered by the V30 rail (default) 1 = P0_02 port output */
#define GPIO_P0_01_OUT_CTRL                   (1U << 1) /* 0 = P0_01 port output is powered by the V30 rail (default) 1 = P0_01 port output */
#define GPIO_P0_00_OUT_CTRL                   (1U << 0) /* 0 = P0_00 port output is powered by the V30 rail (default) 1 = P0_00 port output */

