AlmAck/svdtonuttx/demo/h/da1470x_gpio.h
/* P1_18_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_19_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_20_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_21_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_22_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_23_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_24_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_25_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_26_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_27_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_28_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

