AlmAck/svdtonuttx/demo/h/da1470x_gpio.h
/* P1_29_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_30_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_31_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P1_DATA Register */

#define GPIO_P1_DATA_MASK                     (0xFFFFFFFF << 0) /* Set P1 output register when written; Returns the value of P1 port when read */
#define GPIO_P1_DATA_POS                      (0) /* Set P1 output register when written; Returns the value of P1 port when read */

/* P1_PADPWR_CTRL Register */

#define GPIO_P1_31_OUT_CTRL                   (1U << 31) /* 0 = P1_31 port output is powered by the V30 rail (default) 1 = P1_31 port output */
#define GPIO_P1_30_OUT_CTRL                   (1U << 30) /* 0 = P1_30 port output is powered by the V30 rail (default) 1 = P1_30 port output */
#define GPIO_P1_23_OUT_CTRL                   (1U << 23) /* 0 = P1_23 port output is powered by the V30 rail (default) 1 = P1_23 port output */
#define GPIO_P1_22_OUT_CTRL                   (1U << 22) /* 0 = P1_22 port output is powered by the V30 rail (default) 1 = P1_22 port output */
#define GPIO_P1_12_OUT_CTRL                   (1U << 12) /* 0 = P1_12 port output is powered by the V30 rail (default) 1 = P1_12 port output */
#define GPIO_P1_11_OUT_CTRL                   (1U << 11) /* 0 = P1_11 port output is powered by the V30 rail (default) 1 = P1_11 port output */
#define GPIO_P1_07_OUT_CTRL                   (1U << 7) /* 0 = P1_07 port output is powered by the V30 rail (default) 1 = P1_07 port output */
#define GPIO_P1_06_OUT_CTRL                   (1U << 6) /* 0 = P1_06 port output is powered by the V30 rail (default) 1 = P1_06 port output */
#define GPIO_P1_05_OUT_CTRL                   (1U << 5) /* 0 = P1_05 port output is powered by the V30 rail (default) 1 = P1_05 port output */
#define GPIO_P1_04_OUT_CTRL                   (1U << 4) /* 0 = P1_04 port output is powered by the V30 rail (default) 1 = P1_04 port output */
#define GPIO_P1_03_OUT_CTRL                   (1U << 3) /* 0 = P1_03 port output is powered by the V30 rail (default) 1 = P1_03 port output */
#define GPIO_P1_01_OUT_CTRL                   (1U << 1) /* 0 = P1_01 port output is powered by the V30 rail (default) 1 = P1_01 port output */
#define GPIO_P1_00_OUT_CTRL                   (1U << 0) /* 0 = P1_00 port output is powered by the V30 rail (default) 1 = P1_00 port output */

/* P1_RESET_DATA Register */

#define GPIO_P1_RESET_MASK                    (0xFFFFFFFF << 0) /* Writing a 1 to P1[y] sets P1[y] to 0. Writing 0 is discarded; Reading returns 0 */
#define GPIO_P1_RESET_POS                     (0) /* Writing a 1 to P1[y] sets P1[y] to 0. Writing 0 is discarded; Reading returns 0 */

/* P1_SET_DATA Register */

#define GPIO_P1_SET_MASK                      (0xFFFFFFFF << 0) /* Writing a 1 to P1[y] sets P1[y] to 1. Writing 0 is discarded; Reading returns 0 */
#define GPIO_P1_SET_POS                       (0) /* Writing a 1 to P1[y] sets P1[y] to 1. Writing 0 is discarded; Reading returns 0 */

/* P1_WEAK_CTRL Register */

#define GPIO_P1_31_LOWDRV                     (1U << 31) /* 0 = Normal operation 1 = Reduces the driving strength of P1_30 pad Note: This mo */
#define GPIO_P1_30_LOWDRV                     (1U << 30) /* 0 = Normal operation 1 = Reduces the driving strength of P1_30 pad Note: This mo */
#define GPIO_P1_27_LOWDRV                     (1U << 27) /* 0 = Normal operation 1 = Reduces the driving strength of P1_27 pad Note: This mo */
#define GPIO_P1_26_LOWDRV                     (1U << 26) /* 0 = Normal operation 1 = Reduces the driving strength of P1_26 pad Note: This mo */
#define GPIO_P1_25_LOWDRV                     (1U << 25) /* 0 = Normal operation 1 = Reduces the driving strength of P1_25 pad Note: This mo */
#define GPIO_P1_24_LOWDRV                     (1U << 24) /* 0 = Normal operation 1 = Reduces the driving strength of P1_24 pad Note: This mo */
#define GPIO_P1_23_LOWDRV                     (1U << 23) /* 0 = Normal operation 1 = Reduces the driving strength of P1_23 pad Note: This mo */
#define GPIO_P1_22_LOWDRV                     (1U << 22) /* 0 = Normal operation 1 = Reduces the driving strength of P1_22 pad Note: This mo */
#define GPIO_P1_20_LOWDRV                     (1U << 20) /* 0 = Normal operation 1 = Reduces the driving strength of P1_20 pad Note: This mo */
#define GPIO_P1_19_LOWDRV                     (1U << 19) /* 0 = Normal operation 1 = Reduces the driving strength of P1_19 pad Note: This mo */
#define GPIO_P1_15_LOWDRV                     (1U << 15) /* 0 = Normal operation 1 = Reduces the driving strength of P1_15 pad Note: This mo */
#define GPIO_P1_14_LOWDRV                     (1U << 14) /* 0 = Normal operation 1 = Reduces the driving strength of P1_14 pad Note: This mo */
#define GPIO_P1_13_LOWDRV                     (1U << 13) /* 0 = Normal operation 1 = Reduces the driving strength of P1_13 pad Note: This mo */
#define GPIO_P1_12_LOWDRV                     (1U << 12) /* 0 = Normal operation 1 = Reduces the driving strength of P1_12 pad Note: This mo */
#define GPIO_P1_11_LOWDRV                     (1U << 11) /* 0 = Normal operation 1 = Reduces the driving strength of P1_11 pad Note: This mo */
#define GPIO_P1_07_LOWDRV                     (1U << 7) /* 0 = Normal operation 1 = Reduces the driving strength of P1_07 pad Note: This mo */
#define GPIO_P1_06_LOWDRV                     (1U << 6) /* 0 = Normal operation 1 = Reduces the driving strength of P1_06 pad Note: This mo */
#define GPIO_P1_05_LOWDRV                     (1U << 5) /* 0 = Normal operation 1 = Reduces the driving strength of P1_05 pad Note: This mo */
#define GPIO_P1_04_LOWDRV                     (1U << 4) /* 0 = Normal operation 1 = Reduces the driving strength of P1_04 pad Note: This mo */
#define GPIO_P1_03_LOWDRV                     (1U << 3) /* 0 = Normal operation 1 = Reduces the driving strength of P1_03 pad Note: This mo */
#define GPIO_P1_01_LOWDRV                     (1U << 1) /* 0 = Normal operation 1 = Reduces the driving strength of P1_01 pad Note: This mo */
#define GPIO_P1_00_LOWDRV                     (1U << 0) /* 0 = Normal operation 1 = Reduces the driving strength of P1_00 pad Note: This mo */

/* P2_00_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_01_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

