AlmAck/svdtonuttx/demo/h/da1470x_gpio.h
/* P2_02_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_03_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_04_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_05_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_06_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_07_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_08_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_09_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_10_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_11_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_12_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_13_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

/* P2_14_MODE Register */

#define GPIO_PPOD                             (1U << 10) /* 0: Push pull 1: Open drain */
#define GPIO_PUPD_MASK                        (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PUPD_POS                         (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define GPIO_PID_MASK                         (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define GPIO_PID_POS                          (0) /* See P0_00_MODE_REG[PID] */

