AlmAck/svdtonuttx/demo/h/da1470x_gpio.h
/* P2_DATA Register */

#define GPIO_P2_DATA_MASK                     (0x7FFF << 0) /* Set P2 output register when written; Returns the value of P2 port when read */
#define GPIO_P2_DATA_POS                      (0) /* Set P2 output register when written; Returns the value of P2 port when read */

/* P2_PADPWR_CTRL Register */

#define GPIO_P2_11_OUT_CTRL                   (1U << 11) /* 0 = P2_11 port output is powered by the V30 rail (default) 1 = P2_11 port output */
#define GPIO_P2_10_OUT_CTRL                   (1U << 10) /* 0 = P2_10 port output is powered by the V30 rail (default) 1 = P2_10 port output */
#define GPIO_P2_09_OUT_CTRL                   (1U << 9) /* 0 = P2_09 port output is powered by the V30 rail (default) 1 = P2_09 port output */
#define GPIO_P2_08_OUT_CTRL                   (1U << 8) /* 0 = P2_08 port output is powered by the V30 rail (default) 1 = P2_08 port output */
#define GPIO_P2_01_OUT_CTRL                   (1U << 1) /* 0 = P2_01 port output is powered by the V30 rail (default) 1 = P2_01 port output */

/* P2_RESET_DATA Register */

#define GPIO_P2_RESET_MASK                    (0x7FFF << 0) /* Writing a 1 to P2[y] sets P2[y] to 0. Writing 0 is discarded; Reading returns 0 */
#define GPIO_P2_RESET_POS                     (0) /* Writing a 1 to P2[y] sets P2[y] to 0. Writing 0 is discarded; Reading returns 0 */

/* P2_SET_DATA Register */

#define GPIO_P2_SET_MASK                      (0x7FFF << 0) /* Writing a 1 to P2[y] sets P2[y] to 1. Writing 0 is discarded; Reading returns 0 */
#define GPIO_P2_SET_POS                       (0) /* Writing a 1 to P2[y] sets P2[y] to 1. Writing 0 is discarded; Reading returns 0 */

/* P2_WEAK_CTRL Register */

#define GPIO_P2_09_LOWDRV                     (1U << 9) /* 0 = Normal operation 1 = Reduces the driving strength of P2_09 pad Note: This mo */
#define GPIO_P2_08_LOWDRV                     (1U << 8) /* 0 = Normal operation 1 = Reduces the driving strength of P2_08 pad Note: This mo */
#define GPIO_P2_07_LOWDRV                     (1U << 7) /* 0 = Normal operation 1 = Reduces the driving strength of P2_07 pad Note: This mo */
#define GPIO_P2_06_LOWDRV                     (1U << 6) /* 0 = Normal operation 1 = Reduces the driving strength of P2_06 pad Note: This mo */
#define GPIO_P2_05_LOWDRV                     (1U << 5) /* 0 = Normal operation 1 = Reduces the driving strength of P2_05 pad Note: This mo */
#define GPIO_P2_04_LOWDRV                     (1U << 4) /* 0 = Normal operation 1 = Reduces the driving strength of P2_04 pad Note: This mo */
#define GPIO_P2_01_LOWDRV                     (1U << 1) /* 0 = Normal operation 1 = Reduces the driving strength of P2_01 pad Note: This mo */

/* PAD_DRIVE_CTRL Register */

#define GPIO_EMMC_DRIVE_MASK                  (0x3 << 10) /* Pads drive current 0: 4 mA 1: 8 mA 2: 12 mA 3: 16 mA */
#define GPIO_EMMC_DRIVE_POS                   (10) /* Pads drive current 0: 4 mA 1: 8 mA 2: 12 mA 3: 16 mA */
#define GPIO_EMMC_SLEW_MASK                   (0x3 << 8) /* Pads slew rate control. Indicative values under certain conditions: 0: Rise=1.7  */
#define GPIO_EMMC_SLEW_POS                    (8) /* Pads slew rate control. Indicative values under certain conditions: 0: Rise=1.7  */
#define GPIO_SPI3_DRIVE_MASK                  (0x3 << 2) /* Pads drive current 0: 4 mA 1: 8 mA 2: 12 mA 3: 16 mA */
#define GPIO_SPI3_DRIVE_POS                   (2) /* Pads drive current 0: 4 mA 1: 8 mA 2: 12 mA 3: 16 mA */
#define GPIO_SPI3_SLEW_MASK                   (0x3 << 0) /* QSPI pads slew rate control. Indicative values under certain conditions: 0: Rise */
#define GPIO_SPI3_SLEW_POS                    (0) /* QSPI pads slew rate control. Indicative values under certain conditions: 0: Rise */

#endif /* __DA1470X_GPIO_H */
